a = float(input('Сторона а: '))
b = float(input('Сторона b: '))
c = float(input('Сторона c: '))
d = float(input('Диаметр окружности: '))
r = float(input('Радиус окружноости: '))
p = 3.14

print(f'Периметр квадрата равен: {4*a}')
print(f'Площадь квадрата равна: {a*a}')
print(f'Площадь прямоугольника равна: {a*b}; Периметр прямоугольника равен: {2*(a+b)}')
print(f'Площадь прямоугольника равна: {a*b}; Периметр прямоугольника равен: {2*(a+b)}')
print(f'Длина окружности равна: {p*d}')
print(f'Объем куба равен: {a*a*a}, Площадь поверхности куба равна: {6*(a*a)}')
print(f'Объем прямоугольного параллепипеда равен: {a*b*c}, '
      f'Площадь поверхности прямоугольного параллепипеда равна: {2*(a*b+b*c+a*c)}')
print(f'Длина окружности: {2*p*r}, Площадь круга: {p*(r*r)}')
print(f'Среднее арифметическое двух чисел: {(a+b)/2}')
print(f'Сумма двух чисел: {a+b}')
print(f'Разность двух чисел: {a-b}')
print(f'Произведение двух чисел: {a*b}')
print(f'Частное двух чисел: {a/b}')

